<p><a name="sections"></a></p>


# Sections

- <a href="#DS">Data Structure</a><br>
- <a href="#DM">Data Manipulation</a><br>
- <a href="#grouping">Grouping and aggregration</a><br>
- <a href="#miss">Handling Missing Data</a><br>
- <a href="#sol">Solutions</a><br>

# Pandas

<p><a name="DS"></a></p>
### Data Structure

- Pandas is a large package defining several new data types, plus a variety of convenient functions for data manipulation, plotting, and web scraping.

- The *DataFrame* structure is inspired by the type of same name in R, a programming language popular among statisticians and data scientists.

- Pandas is particularly strong in the area of handling missing data and, relatedly, handling time series data.

- There are four new data structures in pandas: Series, DataFrame, time series and panel. We will mainly discuss the first three.

These are the new data types introduced by pandas:

- **Series**: 1D labeled homogeneously-typed array.
- **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns.
- **Time Series**: Series with index containing datetimes.
- **Panel**: General 3D labeled, also size-mutable array.

We first import the package

In [3]:
import numpy as np
import pandas as pd

<p><a name="series"></a></p>
## Series

A series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index. By default, the index just consists of ordinary array indices, i.e. consecutive integers starting from zero.

In [5]:
obj = pd.Series(['a', 'b', 'c', 'd'])
obj

0    a
1    b
2    c
3    d
dtype: object

Often it will be more desirable to create a series with an index identifying each data point. Here we manually set the index from 1 to 4.

In [6]:
obj2 = pd.Series(['a', 'b', 'c', 'd'], index=[1, 2, 3, 4])
obj2

1    a
2    b
3    c
4    d
dtype: object

The method `values` accesses all the values.

In [15]:
obj.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [8]:
obj.values[1]   # obj.values is simply an array

'b'

The **Series** object is similar to a **dictionary**, `Series.index` is like `dictionary.keys`, and `Series.values` is like `dictionary.values`. We can convert a dictionary to a Series directly:

In [9]:
dict_ = {1: 'a', 2: 'b', 3: 'c', 4: 'd'}
obj3 = pd.Series(dict_)
obj3

1    a
2    b
3    c
4    d
dtype: object

We can of course convert a Series back to a dictionary.

In [10]:
obj3.to_dict()

{1: 'a', 2: 'b', 3: 'c', 4: 'd'}

<p><a name="DF"></a></p>
## DataFrame

A data frame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (integers, strings, floating point numbers, Python objects, etc.), but all must be the same length.

In [50]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# convert to DataFrame
Employee = pd.DataFrame(data)
Employee

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

A data frame can be created with nested list as well. The two ways are equivalent.

In [17]:
df_2=pd.DataFrame([[1.5, 'Ohio', 2000],
                   [1.7, 'Ohio', 2001],
                   [3.6, 'Ohio', 2002],
                   [2.4, 'Nevada', 2001],
                   [2.9, 'Nevada', 2002]], 
                    columns=['pop','state','year'])
df_2

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

A data frame has an attribute **values**, which is of the multidimensional array type.

In [18]:
print df.values
print '-'*55
print df_2.values

[[1.5 'Ohio' 2000]
 [1.7 'Ohio' 2001]
 [3.6 'Ohio' 2002]
 [2.4 'Nevada' 2001]
 [2.9 'Nevada' 2002]]
-------------------------------------------------------
[[1.5 'Ohio' 2000]
 [1.7 'Ohio' 2001]
 [3.6 'Ohio' 2002]
 [2.4 'Nevada' 2001]
 [2.9 'Nevada' 2002]]

data frame v.s. series is similar to 2D array v.s. 1D array. A data frame has column names.

In [21]:
df.columns    # column name
# here u'pop' means the string 'pop' is encoded in unicode

Index([u'pop', u'state', u'year'], dtype='object')

Each column in a DataFrame can be retrieved as a Series. We have two ways to get the column: to retrieve by attribute and to retrieve by dictionary-like notation. They will give the same result.

In [22]:
df.year         # retrieve by attribute

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [23]:
df['year']  # retrieve by dictionary-like notation

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

** Exercise 1** 

Create a Pandas DataFrame, 'Employee', whose columns are 'Name', 'Year' and 'Department'. The rows are supposed to be:

- Bob has been working for IT department for a year.
- Sam has been working for Trade department for 3 years.
- Peter has been working for HR department for 8 years.
- Jake has been working for IT department for 2 years.

Now set the index of Employee to be their names using `set_index` function of a data frame. Make sure you update the DataFrame.

In [68]:
#### Your code here
Employee = pd.DataFrame([["Bob", 1,"IT"],
                    ["Sam",3,"Trade"],
                    ["Peter", 8, "HR"],
                    ["Jake", 2, "IT"]],
                    columns=["Name", "Year", "Department"])
print Employee.set_index("Name", inplace=True)
#print df_3.set_index("Name")
df_3

None

       Year Department
Name
Bob       1         IT
Sam       3      Trade
Peter     8         HR
Jake      2         IT

<p><a name="IO"></a></p>
## I/O tools

Pandas has a number of functions for reading tabular data as a data frame object.

In [45]:
!cat foo.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [46]:
pd.read_csv('foo.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In some cases, there is no header in the file. Set `header = None`, the column names will be filled with incremental numbers.

In [47]:
!cat foo_noheader.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [48]:
pd.read_csv('foo_noheader.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

But we can pass the column names (as a list of strings) to the names parameter in `read_csv`.

In [49]:
# Set the names manually
pd.read_csv('foo_noheader.csv', 
             names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

So far we covered only importing a file. With this exercise we first demonstrate how exporting is done.

**Exercise 2** 

- Write the data frame, `Employee`, to a file, Employee.csv. The function `to_csv` should comes in handy.

In [65]:
#### Your code here
Employee.to_csv("Employee.csv", index_label="Name")
!cat Employee.csv

Name,pop,state,year
0,1.5,Ohio,2000
1,1.7,Ohio,2001
2,3.6,Ohio,2002
3,2.4,Nevada,2001
4,2.9,Nevada,2002

<p><a name="DM"></a></p>
# Data Manipulation in Pandas

Like numpy, pandas defines many broadcast operations, as well as numerous methods of manipulating data.
<p><a name="concat"></a></p>
### concat
Pandas DataFrames can be expanded in both directions. Let’s create two data frames first.

In [ ]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['d','e'],
                   index=['one', 'two', 'three'])
df1

In [ ]:
df2

Since the two data frames have the same number of rows, it is natural that we can combine them "horizontally".

In [ ]:
pd.concat([df1, df2], axis = 1)

- The argument "axis = 1" means expanding along the column indices. Setting "axis = 0" will combine two data frames with same number of columns vertically.

**Exercise 3**

In the iPython notebook, let's create a data frame below. How should we combine it with the old Employee? Observe that this is a data frame with new features.

In [69]:
new_features = pd.DataFrame({'Title': ['analyst', 'associate', 'VP', 'analyst'],\
                            'Education':['Bachelor','PHD','Master','Master'],\
                           'Sex':['M','M','M','M']},\
                            index=['Bob', 'Sam', 'Peter', 'Jake'])
print new_features
Employee

      Education Sex      Title
Bob    Bachelor   M    analyst
Sam         PHD   M  associate
Peter    Master   M         VP
Jake     Master   M    analyst

       Year Department
Name
Bob       1         IT
Sam       3      Trade
Peter     8         HR
Jake      2         IT

In [85]:
#### Your code here
Employee = pd.concat([new_features, Employee], axis =1)

<p><a name="merge"></a></p>
### merge
Merging is the most common way to combine multiple data frames. Let’s create two data frames first.

In [74]:
df1 = pd.DataFrame(np.array([0,0,0,2,2,2,8,8,8]).\
                   reshape((3, 3)),columns=['a','b','c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['b', 'd'],
                   index=['one', 'two', 'four'])
df1

       a  b  c
one    0  0  0
two    2  2  2
three  8  8  8

In [75]:
df2

      b  d
one   0  1
two   2  3
four  4  5

The code below identifies the column ‘b’ from both data frames. The argument 'inner' means it only keeps rows occur in both data frames.

In [76]:
pd.merge(df1, df2, how='inner', on ='b')

   a  b  c  d
0  0  0  0  1
1  2  2  2  3

Without specifying 'how', it’s default to be 'inner'. So the following code performs the same task as above.

In [77]:
pd.merge(df1, df2, on ='b')

   a  b  c  d
0  0  0  0  1
1  2  2  2  3

If we want to keep every row in df1, then we can specify how = "left".

In [78]:
pd.merge(df1, df2, how='left', on ='b')

   a  b  c    d
0  0  0  0  1.0
1  2  2  2  3.0
2  8  8  8  NaN

If we want to keep all rows from both df1 and df2, then we can specify how = "outer".

In [79]:
pd.merge(df1, df2, how='outer', on ='b')

     a  b    c    d
0  0.0  0  0.0  1.0
1  2.0  2  2.0  3.0
2  8.0  8  8.0  NaN
3  NaN  4  NaN  5.0

We can also merge on columns with different columns.

In [80]:
pd.merge(df1, df2, left_on='a', right_on='b')

   a  b_x  c  b_y  d
0  0    0  0    0  1
1  2    2  2    2  3

**Exercise 4**

- Run the following code to create a data frame, 'Salary'. How is this related to the Employee data frame? Why do we separate this piece of information into another data frame?
- How should we combine the two data frames in a meaningful way?

In [101]:
# Your code here
Salary = pd.DataFrame({'Title':['VP', 'associate', 'analyst'],\
                      'Salary':[250, 120, 90]},\
                      columns=['Title', 'Salary'])
Salary
#print Employee
#print Salary
print pd.merge(Employee, Salary,right_index=True , how="inner",on= "Title")
print pd.merge(Employee, Salary, how="left",on= "Title").set_index(Employee.index)

      Education Sex      Title  Year Department  Salary
Name
Bob    Bachelor   M    analyst     1         IT      90
Jake     Master   M    analyst     2         IT      90
Sam         PHD   M  associate     3      Trade     120
Peter    Master   M         VP     8         HR     250
      Education Sex      Title  Year Department  Salary
Name
Bob    Bachelor   M    analyst     1         IT      90
Sam         PHD   M  associate     3      Trade     120
Peter    Master   M         VP     8         HR     250
Jake     Master   M    analyst     2         IT      90

<p><a name="SF"></a></p>
### selection and filter

The `loc` method provides purely label (index/columns)-based indexing. This method only allows you do selection from a data frame by its index and columns. For example:

In [102]:
df1['a']

one      0
two      2
three    8
Name: a, dtype: int64

In [103]:
df1.loc['two'] # the row that has index two

a    2
b    2
c    2
Name: two, dtype: int64

You can also pass a second parameter to loc to specify which column you want to choose. For example:

In [104]:
df1.loc['two', 'b'] # the row that has index two and column b

2

Fancy indexing as in Numpy can be done with `loc` in pandas as well. We may select a row with a condition:

In [105]:
df1.loc[df1.a==0,:]

     a  b  c
one  0  0  0

We may select columns in a similar way:

In [106]:
df1.loc[:,df1.loc['one']==0]

       a  b  c
one    0  0  0
two    2  2  2
three  8  8  8

Note: loc only accepts labels as input. If you try to use numbers, it will give you an error. For example:

In [107]:
df1.loc[1, 2]

TypeError: cannot do label indexing on <class 'pandas.indexes.base.Index'> with these indexers [1] of <type 'int'>

If you want to select data by number, you need the help of iloc. The iloc method provides a purely position based indexing.

In [108]:
# select as a matrix 
# row 2, col 3
df1.iloc[1, 2]

2

In [109]:
# first row, first two columns
# return a Series
row1 = df1.iloc[0, :2]
row1

a    0
b    0
Name: one, dtype: int64

<p><a name="miss"></a></p>
# Handling Missing Data

Missing - or, what amounts to the same thing, corrupt - data is an unavoidable fact of life in dealing with large quantities of data.  There are many ways of dealing with it, depending upon the circumstances:

- Discard it, and all related data.
- Interpolate values from surrounding data
- Isolate it and analyze it separately

Whatever approach is chosen - and this is a scientific, not a computational, question - pandas has methods to make it simpler to carry out.

FIrst, let’s read a csv file that contains NaNs. Note here we set index_col to 0 which means we are using the first column as the index.

In [116]:
df = pd.read_csv('missing.csv', index_col=0)
df

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

If we have no idea about what the dataset looks like, the first thing we want to do is to figure out where the missing data is. We can use the isnull `method`.

In [119]:
df.isnull()

     one    two  three   four
a  False  False  False  False
b   True  False  False  False
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False   True   True  False

Also we can sum up the boolean array to see how many missing values each column has:

In [122]:
np.sum(df.isnull())

one      2
two      2
three    2
four     1
dtype: int64

We may do the same for rows by setting the axis parameter equal to 1.

In [123]:
np.sum(df.isnull(), axis=1)

a    0
b    1
c    0
d    4
e    0
f    2
dtype: int64

Sometimes we need a close look at those NaNs, so we want to have rows that only contain NaNs. To do that , we aggregate the DataFrame with boolean value, `df.isnull()`, by the function any. `axis=1` indicates rows.

In [124]:
df.isnull().any(axis=1)

a    False
b     True
c    False
d     True
e    False
f     True
dtype: bool

Passing the boolean Series to the first position of the `loc` method of the DataFrame selects the rows:

In [125]:
df.loc[df.isnull().any(axis=1),:]

       one       two     three      four
b      NaN -0.217766  0.655179  1.379276
d      NaN       NaN       NaN       NaN
f -1.14906       NaN       NaN -0.160499

**Exercise 5**
- We showed how NaNs can be handled. However, not all missing values are NaNs. Consider the example below:

```
Employee = pd.read_csv('Employee_continue.csv')
```

Print the data frame, looking for missing values by inspection. How many missing values do we have? Some of the missing values might not be NaNs.

In [162]:
Employee = pd.read_csv('Employee_continue.csv')
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5          ?       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT         ?   F         VP   9.0      Mary   262.5

- We saw '?' in the data frame. For a small data frame like this we may replace '?'  by np.nan manually. However, if we deal with a large data frame, we might need the function replace. Use replace to replace '?' by np.nan.

In [163]:
#### Your code here
Employee.replace(to_replace = '?',value=np.nan, inplace=True)
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT       NaN   F         VP   9.0      Mary   262.5

- How many missing values do we have in each row? How many in each column?

In [164]:
#### Your code here
print np.sum(Employee.isnull(), axis=0)
print np.sum(Employee.isnull(), axis=1)

Department    1
Education     1
Sex           0
Title         0
Year          1
Name          0
Salary        0
dtype: int64
0    0
1    0
2    0
3    0
4    0
5    1
6    1
7    0
8    1
dtype: int64

- Print the rows with missing values.

In [165]:
#### Your code here
Employee.loc[Employee.isnull().any(axis=1),:]

  Department Education Sex      Title  Year      Name  Salary
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
8         IT       NaN   F         VP   9.0      Mary   262.5

- Print the columns with missing values.

In [166]:
#### Your code here
Employee.loc[:,Employee.isnull().any(axis=0)]

  Department Education  Year
0         IT  Bachelor   1.0
1         IT    Master   2.0
2         HR    Master   2.0
3         HR  Bachelor   2.0
4      Trade       PHD   3.0
5        NaN       PHD   5.0
6      Trade    Master   NaN
7         HR    Master   8.0
8         IT       NaN   9.0

Once all the missing values are represented by `NaN`s, Pandas provides various methods for them:

<p><a name="dropna"></a></p>
## dropna
We may simply discard the rows with missing values. Below the arguments `axis=0` and `how='any'` indicates dropping *rows* with a NaN in *any* position.

In [167]:
df.dropna(axis=0, how='any')

      data1     data2 key1 key2
0  1.331587 -0.720086    a  one
1  0.715279  0.265512    a  two
2 -1.545400  0.108549    b  one
3 -0.008384  0.004291    b  two
4  0.621336 -0.174600    a  one

We could also drop rows full of NaNs. This can be done with `how='all'`.

In [143]:
df.dropna(axis=0, how='all')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

From the data frame above we can apply `dropna` once more. This time we drop a column with the argument `axis=1`.

In [144]:
df.dropna(axis=0, how='all').dropna(axis=1, how='any')

       four
a -1.015682
b  1.379276
c  1.034417
e -0.492039
f -0.160499

<p><a name="fillna"></a></p>
## fillna

Instead of discarding information we may also **impute** the data. This can be done with `fillna` function with value to be imputed as the argument.

In [145]:
df.fillna(0)

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b  0.000000 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d  0.000000  0.000000  0.000000  0.000000
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.000000  0.000000 -0.160499

- Another common way to impute is by the mean of the column.

In [146]:
df['one'].fillna(df['one'].mean())

a   -1.250699
b   -0.795237
c   -0.860359
d   -0.795237
e    0.079169
f   -1.149060
Name: one, dtype: float64

<p><a name="interpolate"></a></p>
## interpolate

Interpolation means inserting between fixed points. `method='linear'` indicates equally spacing the difference between the values bordering the missing values.

In [147]:
df.interpolate(method='linear')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b -1.055529 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d -0.390595 -0.642305  0.457679  0.271189
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.029138  0.239183 -0.160499

- Since `df.loc['b','one']` is a NaN between `df.loc['a','one']` and `df.loc['c','one']`, the value inserted is the mean of them.

In [148]:
(df.loc['a', 'one'] + df.loc['c', 'one'])/2

-1.0555289364489999

<p><a name="grouping"></a></p>

# Grouping and Aggregation

Grouping and  aggregation is a critical component in data analysis. It is often referred to a process with one or more of the following steps involved:

- **Splitting** data into groups based on some features.
- **Applying** a function to each group independently.
- **Combining** the result into data structure.

### Grouping

Grouping is actually a very natural operation. Let's create a smaple data frame.

In [149]:
np.random.seed(10)
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

df

      data1     data2 key1 key2
0  1.331587 -0.720086    a  one
1  0.715279  0.265512    a  two
2 -1.545400  0.108549    b  one
3 -0.008384  0.004291    b  two
4  0.621336 -0.174600    a  one

A natural question is: How many `a` do we have in `key1`? One way to answer this is to group the data frame by the value in `key1`. That is:

In [150]:
group = df.groupby('key1')

`group` is assigned the value returned by the `groupby` function, whose type is:

In [151]:
print type(group)

<class 'pandas.core.groupby.DataFrameGroupBy'>

Here we introduce an important feature of the object. A `DataFrameGroupBy` object is an `iterable`. That says we can iterate over the object:

In [152]:
for item in group:
    print item

('a',       data1     data2 key1 key2
0  1.331587 -0.720086    a  one
1  0.715279  0.265512    a  two
4  0.621336 -0.174600    a  one)
('b',       data1     data2 key1 key2
2 -1.545400  0.108549    b  one
3 -0.008384  0.004291    b  two)

With a careful inspection we see that each `item` we printed is a `tuple` with two components. In Python, there is an alternative way of iteration:

In [153]:
for key, values in group:
    print key
    print '-'*55
    print values
    print '\n'

a
-------------------------------------------------------
      data1     data2 key1 key2
0  1.331587 -0.720086    a  one
1  0.715279  0.265512    a  two
4  0.621336 -0.174600    a  one


b
-------------------------------------------------------
      data1     data2 key1 key2
2 -1.545400  0.108549    b  one
3 -0.008384  0.004291    b  two

In this way we can print and inspect a `DataFrameGroupBy` object. We also see how **splitting** is done.

**Applying** and **combining** are often done together with a single function. For example:

In [154]:
group.size()

key1
a    3
b    2
dtype: int64

### Aggregration

We may group the dataframe by multiple keys:

In [155]:
group2 = df.groupby(['key1', 'key2'])
group2.mean()

              data1     data2
key1 key2
a    one   0.976461 -0.447343
     two   0.715279  0.265512
b    one  -1.545400  0.108549
     two  -0.008384  0.004291

We may apply multiple functions to each group with the method `agg`:

In [156]:
group2.agg(['count', 'sum', 'min', 'max', 'mean', 'std'])

          data1                                                   data2  \
          count       sum       min       max      mean       std count
key1 key2
a    one      2  1.952922  0.621336  1.331587  0.976461  0.502223     2
     two      1  0.715279  0.715279  0.715279  0.715279       NaN     1
b    one      1 -1.545400 -1.545400 -1.545400 -1.545400       NaN     1
     two      1 -0.008384 -0.008384 -0.008384 -0.008384       NaN     1


                sum       min       max      mean       std
key1 key2
a    one  -0.894686 -0.720086 -0.174600 -0.447343  0.385716
     two   0.265512  0.265512  0.265512  0.265512       NaN
b    one   0.108549  0.108549  0.108549  0.108549       NaN
     two   0.004291  0.004291  0.004291  0.004291       NaN

The column std misses three values because each of ['a', 'one'], ['b', 'one'] and ['b', 'two'] includes only one row in df.
We may apply different aggregating functions to different columns. This can be done with a dictionary.

In [157]:
colFun = {'data1': ['min', 'max'], 'data2': ['mean','std']}
group.agg(colFun)

         data1               data2
           min       max      mean       std
key1
a     0.621336  1.331587 -0.209725  0.493737
b    -1.545400 -0.008384  0.056420  0.073721

We may apply custom aggregation functions. We observe in the previous examples that aggregation functions were applied to each **column** in a data frame. We need to keep this in mind when defining a custom function. For example, we might want to compute mean after removing maxima (truncated mean).

In [158]:
def trunc_mean(x):    # x has to be a 'vector' (1d array or pandas Series)
    return np.mean(x[x!=x.max()])

In [159]:
df.groupby('key1').agg(trunc_mean)

         data1     data2
key1
a     0.668307 -0.447343
b    -1.545400  0.004291

**Exercise 6**

- Find the minimum, mean and the maximum of the 'Year' for each Department.
- How many female or male are in each department? For each sex in each department, what are the minimum, the mean and the maximum of their salary?
- For each department, compute the difference between the maximal salary and the minimal salary.

In [193]:
#### Your code here
#Employee.groupby(['Year']).agg([min, 'mean', max])
#Employee.groupby(['Sex', 'Department']).agg({'Sex':'size', 'Salary':['min','mean','max']})
Employee.groupby(['Department'])[['Salary','Year']].agg(lambda x: x.max()-x.min())
#Employee

            Salary  Year
Department
HR           172.5   6.0
IT           172.5   8.0
Trade          0.0   0.0

<p><a name="sol"></a></p>
# Soluitons

**Exercise 1**

In [ ]:
data = {'Name':['Bob', 'Sam', 'Peter', 'Jake'], \
        'Year':[1,3,8,2],\
        'Department':['IT', 'Trade','HR', 'IT'] }
Employee = pd.DataFrame(data)
Employee

In [ ]:
Employee = Employee.set_index('Name')

In [ ]:
Employee

**Exercise 2**

In [ ]:
Employee.to_csv('Employee.csv', index=True)

**Exercise 3**

In [ ]:
Employee = pd.concat([Employee, new_features], axis =1)
Employee

**Exercise 4**

In [ ]:
pd.merge(Employee, Salary, how='inner', on='Title').set_index(Employee.index)

**Exercise 5**

In [ ]:
Employee = Employee.replace('?', np.nan)
Employee

In [ ]:
np.sum(Employee.isnull())   # Number of missing values in each column.
np.sum(Employee.isnull(), axis=1)   # Number of missing values in each row.

In [ ]:
Employee.loc[Employee.isnull().any(axis=1),:]
Employee.loc[:,Employee.isnull().any(axis=0)]

**Exercise 6**

In [ ]:
Employee.groupby('Department')['Year'].agg(['min','max','mean'])
Employee.groupby(['Department', 'Sex']).agg(['size', 'min','max','mean'])
Employee.groupby('Department')[['Salary']].agg(lambda x: x.max()- x.min())